# ConceptualEnergyDataBuildingServices Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..ConceptualEnergyDataBuildingServices Property
GroupTypeId Class See Also
---
Energy Model - Building Services.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId ConceptualEnergyDataBuildingServices { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConceptualEnergyDataBuildingServices As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ConceptualEnergyDataBuildingServices {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace